Repository: isitanth/hark
Catalog: Sources/HarkApp/Resources/Localizable.xcstrings
Source language: en
Languages: fr

# settings.commands.editor.choose
source: Choose…
fr: Choisir…

# settings.commands.editor.notFound
source: No app by that name on this Mac. It can be saved all the same.
fr: Aucune app de ce nom sur ce Mac. La commande peut être enregistrée quand même.

# settings.commands.editor.aliasesHelp
source: Other names it answers to after the verb, separated by commas.
fr: D’autres noms auxquels elle répond après le verbe, séparés par des virgules.

# settings.commands.editor.cancel
source: Cancel
fr: Annuler

# settings.commands.editor.save
source: Save
fr: Enregistrer

# settings.commands.degradedNone
source: commands.yaml has an error and no earlier version of it worked, so no command runs until it is fixed.
fr: commands.yaml contient une erreur et aucune version précédente ne fonctionnait : aucune commande ne marche avant sa correction.

# settings.commands.empty
source: No command yet. Add one with +.
fr: Aucune commande pour l’instant. Ajoutez-en une avec +.

# settings.commands.test.label %@
source: Test %@
fr: Tester %@

# settings.commands.editor.appHelp
source: A name such as Safari, or the path to an app.
fr: Un nom comme Safari, ou le chemin d’une app.

# settings.commands.editor.collision %@
source: “%@” already opens another app.
fr: « %@ » ouvre déjà une autre app.

# settings.commands.editor.collision %@ %@
source: “%@” already opens %@.
fr: « %@ » ouvre déjà %@.

# settings.commands.brokenFile
source: commands.yaml has an error, so changes made here cannot be saved until it is fixed.
fr: commands.yaml contient une erreur, et les modifications faites ici ne peuvent pas être enregistrées avant sa correction.

# settings.commands.tested.behind %@
source: %@ opened behind the other windows.
fr: L’app « %@ » s’est ouverte en arrière-plan.

# entry.failure.appNotActivated %@
source: Command · “%@” opened behind the other windows
fr: Commande · « %@ » s’est ouverte en arrière-plan

# settings.commands.missing
source: commands.yaml is missing. A change made here writes it again from the commands below.
fr: commands.yaml est introuvable. Une modification faite ici le réécrit à partir des commandes ci-dessous.

# settings.commands.editor.appUnsayable
source: The app’s name has no letter or digit to say.
fr: Le nom de l’app ne contient aucune lettre ni aucun chiffre à dire.

# settings.commands.editor.aliasUnsayable %@
source: “%@” has no letter or digit to say.
fr: « %@ » ne contient aucune lettre ni aucun chiffre à dire.

# settings.commands.editor.onlyFillers %@
source: “%@” is only skipped words, so it can never be heard as an app.
fr: « %@ » n’est fait que de mots ignorés : il ne pourra jamais être entendu comme une app.

# entry.failure.quitting
source: Stopped · Hark was quitting
fr: Arrêté · Hark était en train de quitter

# entry.failure.appExited %@
source: Command · “%@” quit as soon as it opened
fr: Commande · « %@ » s’est fermée dès son ouverture

# settings.commands.tested.exited %@
source: %@ quit as soon as it opened.
fr: L’app « %@ » s’est fermée dès son ouverture.

# settings.commands.tested.timeout %@ %lld
source: %1$@ was still opening after %2$lld seconds.
fr: L’app « %1$@ » s’ouvrait encore après %2$lld secondes.

# notification.inputChanged.title
source: Recording cancelled
fr: Enregistrement annulé

# notification.inputChanged.body
source: The microphone changed while you were speaking. Press the key again to start over.
fr: Le micro a changé pendant que vous parliez. Appuyez de nouveau sur la touche pour recommencer.

# notification.commandFailed.body
source: Check the name in Settings › Commands.
fr: Vérifiez le nom dans Réglages › Commandes.

# notification.commandFailed.retry
source: Try again, or open the app yourself.
fr: Réessayez, ou ouvrez l’app vous-même.

# hud.status.transcribing
source: Transcribing…
fr: Transcription…

# hud.status.limitReached
source: Length limit reached. Transcribing…
fr: Limite de durée atteinte. Transcription…

# settings.general.partialTranscript
source: Show a live transcript while recording
fr: Afficher la transcription en direct pendant l’enregistrement

# settings.general.partialTranscript.help
source: Re-reads the last seconds with a second Small model while you speak. Uses more memory and energy. The text inserted is still the full transcription.
fr: Relit les dernières secondes avec un second modèle Small pendant que vous parlez. Utilise davantage de mémoire et d’énergie. Le texte inséré reste la transcription complète.

# settings.general.partialTranscript.needsSmall
source: Needs the Small model. Download it in the Model tab.
fr: Nécessite le modèle Small. Téléchargez-le dans l’onglet Modèle.

# settings.general.lowerOtherAudio
source: Lower other audio while recording
fr: Baisser le son des autres apps pendant l’enregistrement

# settings.general.lowerOtherAudio.help
source: Turns the output volume down while Hark listens, then back up. If you change the volume meanwhile, Hark leaves it as you set it. Not when you dictate through a Bluetooth headset’s microphone.
fr: Baisse le volume de sortie pendant que Hark écoute, puis le rétablit. Si vous modifiez le volume entre-temps, Hark le laisse tel que vous l’avez réglé. Sauf si vous dictez avec le micro d’un casque Bluetooth.

# panel.recent.clear
source: Clear…
fr: Effacer…

# history.clear.button
source: Clear History…
fr: Effacer l’historique…

# history.clear.title
source: Clear the dictation history?
fr: Effacer l’historique des dictées ?

# history.clear.message
source: This deletes Hark’s log on this Mac, dictated text included. It cannot be undone. New dictations are logged as before.
fr: Cela supprime le journal de Hark sur ce Mac, texte dicté compris. C’est irréversible. Les nouvelles dictées sont journalisées comme avant.

# history.clear.confirm
source: Clear History
fr: Effacer l’historique

# settings.tab.about
source: About
fr: À propos

# settings.about.version %@ %@
source: Version %1$@ (build %2$@)
fr: Version %1$@ (compilation %2$@)

# settings.about.dots
source: The dots in Recent and the Log
fr: Les pastilles des récents et du journal

# settings.about.dot.blue
source: Text where it should be
fr: Texte à sa place

# settings.about.dot.blue.meaning
source: Typed into the field, or copied to the clipboard because that is where you chose to send it.
fr: Tapé dans le champ, ou copié dans le presse-papiers parce que c’est là que vous avez choisi de l’envoyer.

# settings.about.dot.orange
source: Text only on the clipboard
fr: Texte seulement dans le presse-papiers

# settings.about.dot.orange.meaning
source: It was meant for a field and ended up on the clipboard. Also a command or a dictation that stopped at the length limit.
fr: Il était destiné à un champ et a fini dans le presse-papiers. Aussi une commande ou une dictée arrêtée à la durée maximale.

# settings.about.dot.green
source: Command
fr: Commande

# settings.about.dot.green.meaning
source: A command, such as opening an app.
fr: Une commande, comme ouvrir une app.

# settings.about.dot.grey
source: Discarded
fr: Ignoré

# settings.about.dot.grey.meaning
source: Cancelled, too short, or no speech heard.
fr: Annulé, trop court, ou aucune parole entendue.

# settings.about.dot.red
source: Failed
fr: Échec

# settings.about.dot.red.meaning
source: Something went wrong and nothing could be delivered.
fr: Un problème est survenu et rien n’a pu être livré.

# settings.about.dots.hover
source: Hover a row to see how it ended; in the Log, the app and the exact code too.
fr: Survolez une ligne pour voir comment elle s’est terminée ; dans le journal, l’app et le code exact aussi.

# settings.about.footer
source: Engineered with ❤️
fr: Conçu avec ❤️

# settings.general.language
source: Language
fr: Langue

# settings.general.language.system
source: Same as macOS
fr: Comme macOS

# settings.general.language.help
source: The language of Hark’s windows, menus and notifications. The language you dictate in is set in the Model tab.
fr: La langue des fenêtres, menus et notifications de Hark. La langue dans laquelle vous dictez se règle dans l’onglet Modèle.

# settings.general.language.restartNeeded
source: Hark restarts to show the new language.
fr: Hark redémarre pour afficher la nouvelle langue.

# settings.general.language.restart
source: Restart Hark
fr: Redémarrer Hark

# entry.outcome.copied.selectionChanged
source: Text · copied, the selection changed before Replace
fr: Texte · copié, la sélection a changé avant « Remplacer »

# entry.failure.llmUnreachable
source: Ask Hark · the model server is not running
fr: Demander à Hark · le serveur du modèle ne tourne pas

# entry.failure.llmUnauthorized
source: Ask Hark · the API key was refused or is missing
fr: Demander à Hark · clé d’API refusée ou absente

# entry.failure.llmTimeout
source: Ask Hark · the model server did not answer
fr: Demander à Hark · le serveur du modèle n’a pas répondu

# entry.failure.llmError %lld
source: Ask Hark · the server refused the request (%lld)
fr: Demander à Hark · le serveur a refusé la requête (%lld)

# entry.failure.llmErrorInStream
source: Ask Hark · the server stopped on an error
fr: Demander à Hark · le serveur s’est arrêté sur une erreur

# entry.failure.llmEmpty
source: Ask Hark · the model answered nothing
fr: Demander à Hark · le modèle n’a rien répondu

# entry.reason.emptySelection
source: no text selected
fr: aucun texte sélectionné
